'''
Подвиг 5. (Для учебных целей). На вход программе подается строка. Необходимо ее прочитать и в ней заменить
кириллические символы на соответствующие латинские обозначения (без учета регистра букв), а все остальные символы - на
символ дефиса (-). Для этого в программе уже объявлен словарь (см. листинг):

Используя его, примените функцию map, которая бы выдавала преобразованные фрагменты для входной строки.
На основе этой функции сформируйте строку, состоящую из преобразованных фрагментов (фрагменты в строке должны идти
друг за другом без пробелов). Отобразите результат на экране.
Тесты: https://github.com/selfedu-rus/test-python-base/tree/main/9/9.3.5
Sample Input:
Привет Питон
Sample Output:
privet-piton
'''
t = {'ё': 'yo', 'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ж': 'zh',
     'з': 'z', 'и': 'i', 'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p',
     'р': 'r', 'с': 's', 'т': 't', 'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'c', 'ч': 'ch', 'ш': 'sh',
     'щ': 'shch', 'ъ': '', 'ы': 'y', 'ь': '', 'э': 'e', 'ю': 'yu', 'я': 'ya'}

# здесь продолжайте программу
stroka = 'Привет Питон'
new_str = map(str.lower, stroka)
s = ''
for i in new_str:
    if i == ' ':
        s += '-'
    else:
        s += t.get(i)

print(s)
