import sys

# считывание списка из входного потока
#lst_in = list(map(str.strip, sys.stdin.readlines()))

lst_in = [
     "+71234567890 Сергей",
     "+71234567810 Сергей",
     "+51234567890 Михаил",
     "+72134567890 Николай"
]
# здесь продолжайте программу (используйте список lst_in)
d = {}

for x in lst_in:
    if x[13:] in d:
        d[x[13:]].append(x[:12])
    else:
        d[x[13:]] = [x[:12]]

print(*sorted(d.items()))

# +71234567890 Сергей
# +71234567810 Сергей
# +51234567890 Михаил
# +72134567890 Николай